In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

# Professor names
professor_names = ['김유섭', '김은주', '이정근', '양은샘', '신미영', '김선정']

### Merge data

In [2]:
everytime_reviews = pd.read_csv('everytime_reviews.csv', encoding='utf-8-sig')
survey_reviews = pd.read_csv('survey_reviews.csv', encoding='utf-8-sig')

everytime_reviews = everytime_reviews[['professor', 'review']]
survey_reviews = survey_reviews[['professor', 'review']]

df = pd.concat([everytime_reviews, survey_reviews], ignore_index=True)

In [3]:
everytime_reviews['professor'].value_counts()

professor
신미영    270
양은샘    245
김은주    228
이정근    217
김유섭    134
김선정    113
Name: count, dtype: int64

In [4]:
survey_reviews['professor'].value_counts()

professor
김유섭    43
이정근    25
양은샘    24
김은주    24
신미영    23
김선정    16
Name: count, dtype: int64

In [5]:
df['professor'].value_counts()

professor
신미영    293
양은샘    269
김은주    252
이정근    242
김유섭    177
김선정    129
Name: count, dtype: int64

In [6]:
df.to_csv('merged_reviews_by_professor.csv', index=False, encoding='utf-8-sig')